Revit 2027 API
CompoundStructure.GetLayerWidth Method
 Retrieves the width of a specified layer.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetLayerWidth(
	int layerIdx
)
Public Function GetLayerWidth (
	layerIdx As Integer
) As Double
public:
double GetLayerWidth(
	int layerIdx
)
member GetLayerWidth :
        layerIdx : int -> float
Parameters
layerIdx Int32
 Index of a layer in the CompoundStructure. The layer index is zero based. It counts from the exterior of wall and from the top of roofs, floors and ceilings.
Return Value
Double
 The width of the specified layer.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The layer index is out of range.
See Also
Reference
CompoundStructure Class
Autodesk.Revit.DB Namespace